emas/loadtest/emas-performance-report/raw_data/sp4/apache_bench_data/100cus/varnish_ab_test_100_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      100
Time taken for tests:   2.796 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      32552000 bytes
HTML transferred:       31966000 bytes
Requests per second:    357.70 [#/sec] (mean)
Time per request:       279.561 [ms] (mean)
Time per request:       2.796 [ms] (mean, across all concurrent requests)
Transfer rate:          11371.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1   71  45.4     70     151
Processing:   106  200  41.9    201     280
Waiting:        1   65  34.8     64     143
Total:        132  271  27.3    279     327

Percentage of the requests served within a certain time (ms)
  50%    279
  66%    280
  75%    282
  80%    283
  90%    287
  95%    291
  98%    298
  99%    305
 100%    327 (longest request)