emas/loadtest/emas-performance-report/raw_data/sp4/apache_bench_data/100cus/varnish_ab_test_100_10000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      100
Time taken for tests:   27.925 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      325520000 bytes
HTML transferred:       319660000 bytes
Requests per second:    358.10 [#/sec] (mean)
Time per request:       279.249 [ms] (mean)
Time per request:       2.792 [ms] (mean, across all concurrent requests)
Transfer rate:          11383.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1   79  39.3     79     150
Processing:    58  200  38.8    200     278
Waiting:        1   68  32.6     67     134
Total:         61  278   9.3    279     302

Percentage of the requests served within a certain time (ms)
  50%    279
  66%    280
  75%    281
  80%    281
  90%    282
  95%    284
  98%    285
  99%    286
 100%    302 (longest request)